Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/B20B.tmx
Source language: en_us
Languages: zh_cn

source: The rollercoaster, rags-to-riches story of a remarkable animation studio
zh_cn: 难以置信的故事 - 一个优秀的动画工作室从无到有的历程

source: PIXAR'S characters --- whether the heroic toys of "Toy Story", the father and son fish of "Finding Nemo", the insects in "A Bug's Life" or the rat-chef of "Ratatouille"--- Єare full of yearning; for a child to play with, a lost family member, or to become something that seems far out of reach.
zh_cn: 皮克斯(PIXAR)的人物们 - 是《玩具总动员》里的玩具英雄们也好，是《海底总动员》里的父子小丑鱼也好，是《虫虫危机》里的害虫们也好，或是《美食总动员》里的田鼠大厨也好 - 都是有关(主人公)迫切的渴望；要找一个能一起玩的孩子，家庭成员丢失了，或者达成遥不可及的事情。

source: The small company that imagined them is just the same.
zh_cn: 把这些(剧情)想象出来的小公司都是一个(公司).

source: Right from the beginning, Pixar, officially a computer-hardware business, secretly dreamed of a more creative life making feature films.
zh_cn: 从最初开始，皮克斯，官方来说是个计算机硬件商，不为人知的有了制作特色电影这样更有创造力生活的梦想。

source: Ed Catmull's ambition at school had been to become an animator at Disney, but he gave up because he couldn't draw.
zh_cn: 艾德・卡姆尔(Ed Catmull)在学生时代的理想是成为迪士尼的动画设计师，但是因为他当时不会画画所以放弃了。

source: Computer animation, he realised, having graduated in computer science and physics, could be a way to overcome this.
zh_cn: 主修计算机和物理毕业后，他意识到电脑动画可以解决这个问题(不会画画)。

source: So Mr Catmull brought together a small group of people to form a computer-graphics group, which later became Pixar.
zh_cn: 于是这个卡姆尔先生就拉来几个人成立了一个CG团体，也就是Pixar的前身。

source: Their early attempts were uninspiring, however.
zh_cn: 但他们早期的尝试均缺少灵气。

source: Mr Catmull and his colleagues quickly realised that fancy technology was not enough, and that story-telling was just as vital to computer animation as to the hand-drawn sort.
zh_cn: 卡姆尔和他同时快速的意识到眼花缭乱的科技并不是全部，CG里故事叙述(的生动性)与在手绘里一样重要。

source: Under John Lasseter, a young animator rejected by Disney, Pixar started to develop a new kind of cartoon, which eschewed fairy-tale plots and entertained adults as well as children.
zh_cn: 在约翰・拉塞特(John Lasserter) - 一个被迪士尼拒绝了的年轻动画设计师 - 的倡导下，皮克斯开始了一个新的类型的卡通 - 回避了传统童话的剧情 - 而结果令成人观众与孩子们都享受其中。

source: Pixar soon drew the attention of George Lucas, director of the "Star Wars" films, and its future seemed assured.
zh_cn: 皮克斯迅速得到了《星球大战》系列电影的导演乔治・卢卡斯(George Lucas)的注意，它(皮克斯)的命运似乎有了保证。

source: But all Mr Lucas really wanted was for the little company to make whizzy special effects for Lucasfilm's movies, not expensive computer-animated films of its own.
zh_cn: 但卢卡斯先生所需要的不过是想让这个小公司帮他的电影做些夸张的小特效，而不是相对昂贵的工作室自己的电脑动画电影。

source: At one point, in 1985, Pixar, losing money fast, was nearly sold to General Motors and Philips Electronics, which wanted its computer-graphics modelling tools to help design cars and transform medical scans into three-dimensional images.
zh_cn: 1985年一段时间里，皮克斯公司现金快速消耗，差点就要卖给通用汽车和飞利浦电子了。这两个公司想利用他们CG建模的工具设计汽车，以及将医疗扫描片转换成3D图像。

source: Even when Steve Jobs, a co-founder of Apple, came to the rescue, Pixar was still in danger.
zh_cn: 当史蒂夫・乔布斯(Steve Jobs)，苹果的创始人之一，来拯救他们的时候，皮克斯依然岌岌可危。

source: Its pretence to be a computer company was going badly: sales of the Pixar Image Computer were slow.
zh_cn: 对外表现出的计算机公司的形象非常糟糕：皮克斯图像电脑的销售非常缓慢。

source: The only significant way the company was earning money was by making cartoon advertisements to sell other companies' products.
zh_cn: 公司唯一客观的收入来自为其他公司的产品制作卡通广告。

source: But there was reason for hope.
zh_cn: 但是依然有理由对皮克斯寄以希望。

source: "Tin Toy", a short animated film, won an Oscar in 1988, and that was enough to keep Pixar alive and, crucially, to attract the interest of Disney.
zh_cn: 一部动画短片，《锡铁小兵》，在1988年的奥斯卡上获奖，足以令皮克斯恢复生机，更关键的是，引起了迪士尼的兴趣。

source: Together, the two studios made "Toy Story", which became a critical and financial success.
zh_cn: 两个工作室联合制作的《玩具总动员》，带来了命运和经济上两方面的成功。

source: Several more hits followed, and Pixar astounded Hollywood with its consistency.
zh_cn: 另外几个大的热点紧跟其后，皮克斯用其一贯的(高水准)令好莱坞称奇。

source: The studio became widely revered for its creative culture and for its insistence on originality.
zh_cn: 工作室因为创造性的文化和对原创性的坚持而被广泛尊崇。

source: There are few American companies with as saintly a reputation.
zh_cn: 几乎没有几个美国公司能够得到这样一个近乎“神圣”的声誉。

source: In 2006 Disney bought Pixar for $7.4 billion, and promptly put Messrs Catmull and Lasseter in charge of Disney's own animation unit.
zh_cn: 2006年，迪士尼用$76亿美元的价格将皮克斯收购，并迅速的让Messrs 卡姆尔和拉塞特负责迪士尼自身的动画部门。

source: A number of interesting things about Disney emerge in this excellent, readable account of Pixar's early years.
zh_cn: 有几段关于迪士尼的轶事穿插于这段精彩有趣的皮克斯早年的记录里。

source: David Price claims, for instance, that Disney's chief executive, Michael Eisner, considered shutting down the company's animation unit after he took over as chief executive in 1984, an astonishing fact given the subsequent success of cartoon films such as "The Lion King".
zh_cn: 譬如，David Price声称迪士尼的总裁，迈克尔・埃斯纳尔(Michael Eisner)，在1984年执掌迪士尼后，曾考虑将公司的电脑部门关闭。这在(迪士尼)刚刚获得一系列的卡通电影诸如《狮子王》之后是一个令人震惊的举动。

source: Mr Price also makes clear just how much Pixar owes to Disney: it was the larger company's marketing for "Toy Story", for instance, that gave Mr Jobs the confidence to launch an initial public offering of shares in Pixar in 2005.
zh_cn: Price先生还明确的提起了到底皮克斯欠了迪士尼多少：都是因为作为大公司的迪士尼为《玩具总动员》的商业宣传给了乔布斯先生信心在2005年启动了IPO。

source: Mr Price leaves Pixar and its animators in the arms of Mickey Mouse and friends, and assumes that all will be well.
zh_cn: Price先生把皮克斯丢进了米老鼠和它的伙伴们的怀里，假想一切都会顺理成章。

source: So far, the acquisition has undoubtedly benefited Disney.
zh_cn: 至此，这项收购无疑的给迪士尼带来的巨大利益。

source: Creative types who left the animation giant in recent years are beginning to return, and morale is high at the company as Pixar prepares next month to launch its ninth feature film, "Wall-E", about a robot in the year 2700.
zh_cn: 近年离开动画巨人的创意型人才开始回归，随着Pixar下个月即将揭幕的第九部电影 - Wall-E - 一部关于生活在2700年的机器人的电影 - 的筹备，公司里的士气高涨。

source: But will the company have the same energy in future, and what will happen when Mr Lasseter has his next "creative" spat with Disney? Pixar's life from here on, safely tucked away inside a powerful corporation, is likely to be less visible.
zh_cn: 但是在未来是否能维持这样的能量？当拉塞特需要在迪士尼进行下一部的创作时将会带来什么？被安全的安置在一个有实力的企业内部后，皮克斯从此的生活将少为外界所知。

source: But that does not mean it will be any less interesting.
zh_cn: 但是这不意味着它会失去丝毫的趣味。
